cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap "buo/cask-upgrade" # Allows us to run 'brew cu' to update casks

#brew 'bc'
#brew 'imagemagick'
#brew 'spaceman-diff'
#brew 'spark'
#brew 'stripe/stripe-cli/stripe'
#brew 'yt-dlp'
#brew "terraform"

brew 'azure-cli'
brew 'fastfetch'
brew 'jq'
brew 'ollama'
brew 'podman'
brew 'smartmontools'
brew 'wget'
brew "git"

#cask 'airtable'
#cask 'arq'
#cask 'handbrake'
#cask 'notion-calendar'
#cask 'plex'
#cask 'raycast' # Raycast still doesn't support sandboxing for extensions: https://github.com/raycast/extensions/issues/200
#cask 'sonos'
#cask 'warp'
#cask 'zed'

cask '1password'
cask 'chatgpt'
cask 'iterm2'
cask 'microsoft-edge'
#cask 'obsidian'
cask 'podman-desktop'
cask 'rekordbox'
cask 'signal'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'

# Apple App Store apps
mas "1Password for Safari", id: 1569813296
mas "Home Assistant", id: 1099568401
mas "Kindle", id: 302584613
mas "Mela", id: 1568924476
mas "Microsoft 365", id: 1450038993
mas "Notability", id: 360593530
#mas "Obsidian Web Clipper", id: 6720708363
mas "Windows", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
